Revit 2017 API
StructuralSectionCProfile Class
 Defines parameters for C Profile structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionCProfile : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionCProfile _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionCProfile : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile
See Also
StructuralSectionCProfile Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace